# 编程语言C/C++

## 一、语言的区别

### 1.C++和Python的区别

包括但不限于：

1. Python是一种脚本语言，是解释执行的，而C++是编译语言，是需要编译后在特定平台运行的。python可以很方便的跨平台，但是效率没有C++高。
2. Python使用缩进来区分不同的代码块，C++使用花括号来区分
3. C++中需要事先定义变量的类型，而Python不需要，Python的基本数据类型只有数字，布尔值，字符串，列表，元组等等
4. Python的库函数比C++的多，调用起来很方便



### 2.C++和C语言的区别

1. C++中new和delete是对内存分配的运算符，取代了C中的malloc和free。
2. 标准C++中的字符串类取代了标准C函数库头文件中的字符数组处理函数（C中没有字符串类型）。
3. C++中用来做控制态输入输出的iostream类库替代了标准C中的stdio函数库。
4. C++中的try/catch/throw异常处理机制取代了标准C中的setjmp()和longjmp()函数。
5. C++函数可以重载，C语言不允许。
6. C++中，允许变量定义语句在程序中的任何地方，只要在是使用它之前就可以；而C语言中，必须要在函数开头部分。
7. 在++中，除了值和指针之外，新增了引用。引用型变量是其他变量的一个别名，我们可以认为他们只是名字不相同，其他都是相同的。
8. C++相对与C增加了一些关键字，如：bool、using、dynamic_cast、namespace等等



### 3.C++与Java的区别

**语言特性：**

1. Java语言给开发人员提供了更为简洁的语法；完全面向对象，由于JVM可以安装到任何的操作系统上，所以说它的可移植性强
2. Java语言中没有指针的概念，引入了真正的数组。不同于C++中利用指针实现的“伪数组”，Java引入了真正的数组，同时将容易造成麻烦的指针从语言中去掉，这将有利于防止在C++程序中常见的因为数组操作越界等指针操作而对系统数据进行非法读写带来的不安全问题
3. C++也可以在其他系统运行，但是需要不同的编码（这一点不如Java，只编写一次代码，到处运行），例如对一个数字，在windows下是大端存储，在unix中则为小端存储。Java程序一般都是生成字节码，在JVM里面运行得到结果
4. Java用接口(Interface)技术取代C++程序中的抽象类。接口与抽象类有同样的功能，但是省却了在实现和维护上的复杂性

**垃圾回收：**

1. C++用析构函数回收垃圾，写C和C++程序时一定要注意内存的申请和释放
2. Java语言不使用指针，内存的分配和回收都是自动进行的，程序员无须考虑内存碎片的问题

应用场景

1. Java在桌面程序上不如C++实用，C++可以直接编译成exe文件，指针是c++的优势，可以直接对内存的操作，但同时具有危险性 。（操作内存的确是一项非常危险的事情，一旦指针指向的位置发生错误，或者误删除了内存中某个地址单元存放的重要数据，后果是可想而知的）
2. Java在Web 应用上具有C++ 无可比拟的优势，具有丰富多样的框架
3. 对于底层程序的编程以及控制方面的编程，C++很灵活，因为有句柄的存在



### 4.为什么C++没有垃圾回收机制？这点跟Java不太一样



	// 此处的虚函数是通过指针调用的，呈现多态性，需要在运行时期间才能确定，所以不能为内联。  
	Base *ptr = new Derived();
	ptr->who();

	// 因为Base有虚析构函数（virtual ~Base() {}），所以 delete 时，会先调用派生类（Derived）析构函数，再调用基类（Base）析构函数，防止内存泄漏。
	delete ptr;
	ptr = nullptr;

	system("pause");
	return 0;
} 
````



### 35.静态函数能定义为虚函数吗？常函数呢？说说你的理解

**静态函数不能是虚函数**

静态与非静态成员函数之间有一个主要的区别，那就是静态成员函数没有this指针。

虚函数依靠vptr和vtable来处理。vptr是一个指针，在类的构造函数中创建生成，并且只能用this指针来访问它，因为它是类的一个成员。vptr指向保存虚函数地址的vtable

对于静态成员函数，它没有this指针，所以无法访问vptr。

**虚函数的调用关系：this -> vptr -> vtable ->virtual function**

**常函数可以为虚函数**



### 36.哪些函数不能是虚函数？把你知道的都说一说

**五类函数不能声明为虚函数：**

1. **普通函数（非成员函数）**：普通函数不属于类的成员函数，不具有继承特性，因此普通函数没有虚函数
2. **构造函数：**虚表指针的初始化时在构造函数进行的，而虚函数需要放到虚表中。在调用虚函数前，必须首先知道虚表指针，此时矛盾就出来了。
3. **内联函数：**内联函数属于静态联编，即内联函数是在编译期间直接展开，可以减少函数调用的花销，即是在编译阶段就确定调用哪个函数了。但是虚函数是属于动态联编，即是在运行时才确定调用哪一个函数。显然这两个是冲突的。（内联函数也可以是虚函数，见14）
4. **静态函数：**从技术层面上说，静态函数的调用不需要传递this指针。但是虚函数的调用需要this指针，来找到虚函数表，相互矛盾；从存在的意义上说，静态函数的存在时为了让所有类共享，可以在对象产生之前执行一些操作。与虚函数的作用不是一路的。
5. **友元函数：**友元函数不属于类的成员函数，不能被继承。对于没有继承特性的函数没有虚函数的说法

### 37.什么是虚继承

**（1）多继承的问题**

多继承容易产生命名冲突，即使将所有类的成员变量和成员函数都命名为不同的名字，仍然可能出现命名冲突，菱形继承：

![20210104152509818](C:\Users\dell\Desktop\临时\11.13\img\菱形继承.png)

**（2）虚继承**

为了解决多继承时的**命名冲突和冗余数据**问题，C++ 提出了虚继承，使得在派生类中只保留一份间接基类的成员。

 虚继承的目的是让某个类做出声明，承诺愿意共享它的基类。这个被共享的基类称为**虚基类**（Virtual Base Class）。

```
继承关系中，越靠近派生类的基类优先级越高，即当A和B中有同名成员，那么D中访问的是B中的成员
```

**（3）虚继承时的构造函数**

1. 普通继承中。派生类构造函数只调用直接基类的构造函数，不能调用间接基类的构造函数；而在虚继承中，派生类除了要调用直接基类的构造函数，还要调用虚基类的构造函数（虚基类时间接基类）

   普通继承是由直接基类调用间接基类的构造函数，但是在菱形继承时有两个直接基类调用同一个间接基类的构造函数，这样会使得编译器不知道按照哪个调用初始化，因此将直接基类的构造函数调用视为无效的，转而由派生类调用间接基类的构造函数

2. 普通继承的构造函数调用是按照初始化列表中构造函数的出现顺序依次进行的；而虚继承必须先调用虚基类的构造函数，而不管初始化列表中的顺序

```c++
#include <iostream>
using namespace std;
//虚基类A
class A{
public:
    A(int a): m_a(a){ }
protected:
    int m_a;
};

//直接派生类B
class B: virtual public A{
public:
    B(int a, int b): A(a), m_b(b){ }
public:
    void display(){
    	cout<<"m_a="<<m_a<<", m_b="<<m_b<<endl;
	}
protected:
    int m_b;
};

//直接派生类C
class C: virtual public A{
public:
    C(int a, int c): A(a), m_c(c){ }
public:
    void display(){
    	cout<<"m_a="<<m_a<<", m_c="<<m_c<<endl;
	}
protected:
    int m_c;
};

// 派生类D
class D: public B, public C{
public:
    D(int a, int b, int c, int d): A(a), B(90, b), C(100, c), m_d(d){ }
public:
    void display(){
    	cout<<"m_a="<<m_a<<", m_b="<<m_b<<", m_c="<<m_c<<", m_d="<<m_d<<endl;
	}
private:
    int m_d;
};

int main(){
    B b(10, 20);
    b.display();
   
    C c(30, 40);
    c.display();
    D d(50, 60, 70, 80);
    d.display();
    return 0;
}
```

**（4）虚继承的原理**

1. 继承自虚基类A的类B和类C分别会多出一个成员变量vbptr（virtual base table pointer，虚基类表指针），该指针指向虚基类表，可以被继承
2. 虚基类表有两项，第一项为vbptr到本类的偏移地址（就是B、C类中的虚基类表指针与B、C类的偏移地址）；第二项为vbptr到虚基类的偏移地址（就是B、C类的虚基类表指针与虚基类A的偏移地址）

```c++
// 查看C++对象内存布局
工具 -->  命令行 --> 开发者命令提示
--> 键入cl /d1 reportSingleClassLayout[类名] [cpp文件夹名]

// 类A
class A size(4):
        +---
 0      | m_a
        +---
      
// 类B            
 class B size(12):
        +---
 0      | {vbptr}
 4      | m_b
        +---
        +--- (virtual base A)
 8      | m_a
        +---

B::$vbtable@:
 0      | 0
 1      | 8 (Bd(B+0)A)
vbi:       class  offset o.vbptr  o.vbte fVtorDisp
               A       8       0       4 0
    
// 类C    
class C size(12):
        +---
 0      | {vbptr}
 4      | m_c
        +---
        +--- (virtual base A)
 8      | m_a
        +---

C::$vbtable@:
 0      | 0
 1      | 8 (Cd(C+0)A)
vbi:       class  offset o.vbptr  o.vbte fVtorDisp
               A       8       0       4 0
               
// 类D
// 继承自类B的虚基类表指针与类B的偏移为0，与类A的偏移为20
// 继承自类C的虚基类表指针与类C的偏移为0，与类A的偏移为12
// 而A类中的成员变量在类C中的地址为20，那么继承自类B的虚基类表指针加上偏移20即可找到
// 继承自类C的虚基类表指针加上偏移12即可找到
class D size(24):
        +---
 0      | +--- (base class B)
 0      | | {vbptr}
 4      | | m_b
        | +---
 8      | +--- (base class C)
 8      | | {vbptr}		// 地址为8，加上到虚基类A的地址偏移12，找到m_a
12      | | m_c
        | +---
16      | m_d
        +---
        +--- (virtual base A)
20      | m_a
        +---

D::$vbtable@B@:
 0      | 0
 1      | 20 (Dd(B+0)A)

D::$vbtable@C@:
 0      | 0
 1      | 12 (Dd(C+0)A)
vbi:       class  offset o.vbptr  o.vbte fVtorDisp
               A      20       0       4 0      
```

### 38.多继承的优缺点，作为一个开发者怎么看待多继承

**（1）多继承**

一个派生类可以有两个或多个基类。

构造函数的调用顺序按照继承时的顺序，与初始化列表顺序无关

```c++
#include <iostream>
using namespace std;
//基类
class BaseA {
public:
	BaseA(int a, int b) : m_a(a), m_b(b) {
		cout << "BaseA constructor" << endl;
	}
	~BaseA() {
		cout << "BaseA destructor" << endl;
	}
protected:
	int m_a;
	int m_b;
};

//基类
class BaseB {
public:
	BaseB(int c, int d) : m_c(c), m_d(d) {
